{"title": "Bitnomial launches first XRP futures in U.S. after SEC drops Ripple case", "description": "Crypto derivatives exchange Bitnomial has officially launched its XRP futures contract after Ripple announced the SEC had dropped its appeal", "image": "https://crypto.news/app/uploads/2024/12/crypto-news-XRP-option03-1.webp", "content": "Bitnomial launches first XRP futures in U.S. after SEC drops Ripple case Skip to content Free Bitcoins Buy Crypto Events Meme Coins Tap-to-earn Contact us About Newsletters Advertise TR crypto.news News All Bitcoin Blockchain Ethereum DeFi Altcoin Regulation Solana Shiba Inu Feature Opinion Follow-up Markets Learn Prices TR Search Search Search Close search Bitcoin (BTC) $78,922.00 -4.53336 Bitcoin price Ethereum (ETH) $1,565.30 -11.26128 Ethereum price BNB (BNB) $554.75 -4.5747 BNB price Solana (SOL) $107.29 -6.88307 Solana price XRP (XRP) $1.90 -8.94177 XRP price Shiba Inu (SHIB) $0.0000114 -4.44101 Shiba Inu price Pepe (PEPE) $0.0000065 -5.96761 Pepe price Bonk (BONK) $0.0000102 -4.31924 Bonk price dogwifhat (WIF) $0.348351 -4.55582 dogwifhat price Popcat (POPCAT) $0.141166 -6.80116 Popcat price Bitcoin (BTC) $78,922.00 -4.53336 Bitcoin price Ethereum (ETH) $1,565.30 -11.26128 Ethereum price BNB (BNB) $554.75 -4.5747 BNB price Solana (SOL) $107.29 -6.88307 Solana price XRP (XRP) $1.90 -8.94177 XRP price Shiba Inu (SHIB) $0.0000114 -4.44101 Shiba Inu price Pepe (PEPE) $0.0000065 -5.96761 Pepe price Bonk (BONK) $0.0000102 -4.31924 Bonk price dogwifhat (WIF) $0.348351 -4.55582 dogwifhat price Popcat (POPCAT) $0.141166 -6.80116 Popcat price Bitcoin (BTC) $78,922.00 -4.53336 Bitcoin price Ethereum (ETH) $1,565.30 -11.26128 Ethereum price BNB (BNB) $554.75 -4.5747 BNB price Solana (SOL) $107.29 -6.88307 Solana price XRP (XRP) $1.90 -8.94177 XRP price Shiba Inu (SHIB) $0.0000114 -4.44101 Shiba Inu price Pepe (PEPE) $0.0000065 -5.96761 Pepe price Bonk (BONK) $0.0000102 -4.31924 Bonk price dogwifhat (WIF) $0.348351 -4.55582 dogwifhat price Popcat (POPCAT) $0.141166 -6.80116 Popcat price Bitcoin (BTC) $78,922.00 -4.53336 Bitcoin price Ethereum (ETH) $1,565.30 -11.26128 Ethereum price BNB (BNB) $554.75 -4.5747 BNB price Solana (SOL) $107.29 -6.88307 Solana price XRP (XRP) $1.90 -8.94177 XRP price Shiba Inu (SHIB) $0.0000114 -4.44101 Shiba Inu price Pepe (PEPE) $0.0000065 -5.96761 Pepe price Bonk (BONK) $0.0000102 -4.31924 Bonk price dogwifhat (WIF) $0.348351 -4.55582 dogwifhat price Popcat (POPCAT) $0.141166 -6.80116 Popcat price Bitnomial launches first XRP futures in U.S. after SEC drops Ripple case By Benson Toti Mar 19, 2025 at 5:06 PM UTC Edited by Jayson Derrick News Share Link copied Crypto derivatives exchange Bitnomial has officially launched its XRP futures contract following the latest developments in the Ripple case. On March 19, 2025, Ripple chief executive officer Brad Garlinghouse announced that the U.S. Securities and Exchange Commission had dropped its appeal in the regulator’s case against Ripple. Shortly after, Bitnomial said it was dropping it’s own case against SEC. More than that, the crypto derivatives exchange revealed the launch of its XRP( XRP ) futures contract, the product that informed the lawsuit against the then Gary Gensler led SEC. With the SEC now under new leadership and a pro-crypto stance under President Donald Trump, Bitnomial is moving forward with its product rollout. You might also like: Bitnomial receives CFTC nod for derivatives clearing in US In its announcement, Bitnomial said it had “voluntarily withdrawn” its own suit against the regulator. That initial lawsuit came in October 2024, the firm suing the agency after the SEC claimed jurisdiction over the proposed XRP futures product. According to Bitnomial, the XRP futures contract will go live this Thursday, with approval from the Commodity and Futures Trading Commission. “Bitnomial is launching the first-ever CFTC-regulated $XRP futures in the U.S. — physically settled for real market impact. Plus, we’ve voluntarily dismissed our case against the SEC as regulatory clarity improves,” the exchange wrote in an X post. According to Bitnomial, current clients can access the XRP futures contracts beginning March 20, 2025. Meanwhile, all prospective clients will have an opportunity to onboard with one of the crypto derivatives exchange’s futures commission merchant partners. FCM partners are entities that help investors buy and sell futures contracts. For Bitnomial, they include Bitnomial Clearing, an exchange affiliated futures commission merchant. XRP price rose sharply after the Ripple announcement and could continue higher amid further bullish projections. Read more: Top 3 XRP tokens to buy after the end of SEC vs Ripple case Read more about futures Ripple SEC Rexas Finance Presale RWA Ecosystem Certik Audited Raised Above $35,000,000 40,000+ Holders 100,000+ Community Join Presale Now Rating Load More XRP $1.90 24h Volume $15,825,874,294 Market Cap $110,304,048,485 24h Low/High $1.65 / $2.08 24h -8.94% 7d -10.71% Deep Dives Feature Read more - Bank of Englan’s crypto skeptic Andrew Bailey to lead global bank regulator group Bank of Englan’s crypto skeptic Andrew Bailey to lead global bank regulator group BTC Bitcoin 57 minutes ago Feature Read more - Bitcoin bleeds, stocks sink, and tariffs spike — is this the start of a global sell-everything moment? Bitcoin bleeds, stocks sink, and tariffs spike — is this the start of a global sell-everything moment? BTC Bitcoin ETH Ethereum SOL Solana 2 hours ago Opinion Read more - Miners win most from the US Strategic Bitcoin Reserve | Opinion Miners win most from the US Strategic Bitcoin Reserve | Opinion BTC Bitcoin 3 hours ago Feature Read more - House of Cards: NFT industry braces for impact as activity slows, marketplaces collapse House of Cards: NFT industry braces for impact as activity slows, marketplaces collapse 23 hours ago Recap Read more - SEC revisits crypto rules, tariffs cause market downturn, Circle IPO uncertain | Weekly Recap SEC revisits crypto rules, tariffs cause market downturn, Circle IPO uncertain | Weekly Recap BTC Bitcoin 1 day ago Opinion Read more - The United States is focused on tokenized certificates of deposit | Opinion The United States is focused on tokenized certificates of deposit | Opinion 1 day ago Follow-up Read more - Ethereum to achieve instant finality? Vitalik Buterin’s roadmap aims to silence critics Ethereum to achieve instant finality? Vitalik Buterin’s roadmap aims to silence critics ETH Ethereum 2 days ago Feature Read more - New DeFi platforms emerge as stock markets turn chaotic New DeFi platforms emerge as stock markets turn chaotic BTC Bitcoin ETH Ethereum SOL Solana 2 days ago Opinion Read more - Note to Jeffrey Goldberg and all journalists: How to prove facts using blockchain | Opinion Note to Jeffrey Goldberg and all journalists: How to prove facts using blockchain | Opinion 2 days ago Opinion Read more - The secret to a high-performing portfolio? Automation | Opinion The secret to a high-performing portfolio? Automation | Opinion BTC Bitcoin ETH Ethereum 2 days ago Related News Previous Next Markets Read more - Red alert: XRP price loses key support and forms a death cross Red alert: XRP price loses key support and forms a death cross XRP XRP 2 hours ago News Read more - SEC says “Covered Stablecoins” not under its jurisdiction SEC says “Covered Stablecoins” not under its jurisdiction USDT Tether USDC USDC 3 days ago News Read more - Ripple to pilot RLUSD for drought relief in Kenya Ripple to pilot RLUSD for drought relief in Kenya RLUSD Ripple USD ETH Ethereum 3 days ago Sign up for crypto news and market insights Get crypto market analysis and curated news delivered right to your inbox every week. Email Subscribe You have successfully joined our subscriber list. crypto.news News Market Cap Free Bitcoins Buy Crypto Learn Glossary Sitemap News Bitcoin Blockchain Ethereum DeFi Altcoin Regulation Predictions Podcast Info Advertise Contact us About Careers Terms Terms of Service Privacy Policy Cookie Policy Social X Telegram LinkedIn Google News RSS Feed crypto.news © 2015-2025 crypto.news Search Search News All Bitcoin Blockchain Ethereum DeFi Altcoin Regulation Solana Shiba Inu Feature Opinion Follow-up Markets Prices Learn Free Bitcoins Buy Crypto Events Meme Coins Tap-to-earn Newsletters Advertise Info Contact us About Careers Glossary Terms Terms of Service Privacy Policy Cookie Policy Our site uses cookies and similar technologies. By using our site you consent to the use of cookies. Find additional information on how we use cookies in our Cookie Policy . I accept cookies"}