{"filename": "ResponseSummary.pdf", "content": "Below is a summary of your\nresponses\nDownload PDF\nBelow is a copy of your responses. Please look this over carefully and if anything is\nincorrect please use the back button below (not the browser's back button) to make\ncorrections before clicking 'submit'. \nOnce you've made any corrections and to submit your responses, please scroll to the\nbottom of this page and hit \"Next\".\nYou are welcome to download and save this PDF for your records.\nAndrew,\nWelcome to the next step of the graduation process: \nCompleting your graduation\nquestionnaire.\nYou are on your way to achieving the historic milestone of completing your \nBachelor of\nScience Computer Science\n at Southern New Hampshire University. Congratulations on\nthe approach of such a worthwhile accomplishment!\nThe following questions are an important step in the graduation process. Many conferral-\nrelated policies and details about your certificate or degree will be confirmed. Your\nresponses also let Career Services know your plans after graduation.  \nFailure to complete\nthis questionnaire may cause you to miss important details about your upcoming conferral.\nNow that you have begun the questionnaire, please complete it one sitting. Navigating\naway from the page may prevent you from completing the remaining questions.\n  \n*If you are completing additional credentials than what is noted in \nbold \nabove, you will receive a separate degree audit result email\nwith a separate graduation questionnaire link after you've petitioned to graduate for that program.\nPlease note that the information contained within this questionnaire is as of\nthe original date of issue.  Any changes made after the original date of issue\nwill not be reflected. will not be reflected. \nThe following questions explain the information that will be printed on your\ncertificate or degree, confirms where we should mail your documents, and\nexplains when you should expect your conferral and certificate or degree.\n \n \nI understand that my name will appear on my certificate or degree as\nAndrew Robinson \nUnless otherwise instructed, your certificate or degree will be mailed to the\nfollowing address:\n117 Hillsdale Road\nEast Brunswick, NJ 08816\nIs this correct?\nYes\nNo117 Hillsdale Road\nEast Brunswick, NJ 08816\nI understand that changing my address with the university does not affect\nmy graduation information. \nIf I change my address with the university\nbetween the time when I complete this questionnaire and my\nconferral, I must submit a \nrequest \nthrough the SNHU Service Portal\nto the Office of the University Registrar to update the address for my\ncertificate or degree. \nOtherwise, my certificate or degree will be mailed to\nthe above address.\nI understand that I must continue to check my SNHU email (even after\nconferral) for any and all communications from the University regarding\nconferral, Commencement, and other important events.\n \nYes\nNo\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.I understand that my certificate or degree will read 'Southern New\nHampshire University' and list my program as: \nBachelor of Science\nComputer Science\n.\nIf you have any additional academic information that is not listed above\n(such as additional majors, minors, and specializations), it will only be\nrecorded on your transcript and not on your certificate or degree.\n \nPlease note: Your certificate or degree will not list the method of instruction\nfor your credential (online, on campus, competency-based, etc.)\nI understand that my anticipated conferral date is 5/1/2023. To be eligible\nfor this conferral date, I must complete all my program requirements and\nfinal grades must be submitted to the Registrar's Office prior to this date.\nFailure to complete my requirements or changing my academic record in a\nsignificant way (i.e. changing programs) may result in a delayed anticipated\nconferral date.\nI also understand that if I anticipate completion of my program\nrequirements sooner than the anticipated conferral date listed above I must\ncontact the Registrar's Office to have my conferral date adjusted.\nresponses.\n \nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.I understand that the Office of the University Registrar has 10 business days\nfrom my conferral date (5/1/2023) to confer my credential and post it to my\nrecord. After that, it may take up to 10 additional business days to issue my\ncertificate or degree. This does not include weekends or holidays.\n \nOnce the conferral process is complete, you will receive a Conferral\nConfirmation email from the Office of the University Registrar.\nI understand that the instructions for ordering my final official transcript will\nbe included with my Conferral Confirmation email from the Office of the\nUniversity Registrar.\n \nI understand that if I place an order for a copy of my final official transcript\nprior to the date I receive the conferral confirmation email from the Office of\nthe University Registrar, my conferred degree and date will not be listed and\nthat my conferred conferred degree and date will be listed on my final official\ntranscript by the end of the tenth business day following my conferral\n(5/1/2023).\nI understand that the next communication I receive regarding my conferral\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.I understand that the next communication I receive regarding my conferral\nwill be sent on or around my anticipated conferral date of (5/1/2023) and all\ncommunication will be directed to my SNHU email address.\nPrior to your certificate or degree being conferred, you must satisfy\nall University and program requirements. The questions below show your\nprogress towards these requirements.\n \nI understand and agree with the results of my official certificate or degree\naudit conducted by the Office of the University Registrar and understand that\nI must successfully complete these requirements before conferral. \n \nMy current remaining degree requirements are as follows:\n23EW3: IDS-403, CS-330, CS-465;\n23EW4: CS-360, CS-470, IT-212\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish yourI understand that I must meet the institutional credit requirement for\ncourses taken at SNHU.\nYou have earned a total of 54 institutional credits, a minimum of 30\ninstitutional credits are required for all Bachelor certificate or degree\nprograms.\nPlease Note: 12 credits in your major field must also be institutional.\nThis table indicates the university requirements regarding honor cords and\nceremonial honors:\n \nRequirements\nRequirements\nAcknowledgment\nAcknowledgment\nMinimum\nInstitutional\nCredits:\nAssociate’s =\n15 /\nBachelor’s\n=30\nCumulative\nGPA 3.500 -\n3.699\nHonors\nCum Laude\nMinimum\nInstitutional\nCredits:\nAssociate’s =\n15 /\nBachelor’s\nCumulative\nGPA 3.700 -\n3.849\nHigh Honors\nMagna Cum\nLaude\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.Bachelor’s\n=30\nMinimum\nInstitutional\nCredits:\nAssociate’s =\n15 /\nBachelor’s\n=30\nCumulative\nGPA 3.850 –\n4.000\nHighest Honors\nSumma Cum\nLaude\n \nYou have currently earned 54 institutional credits.\nYour current Cumulative GPA is 4.000.\n \nPlease note: If you are attending the commencement ceremony and you are\neligible for an honors cord, you will not receive it until the day of the\nceremony. Ceremonial Honors does not display on your degree/certificate. \n \nI understand the institutional policies regarding honor cords and ceremonial\nhonors. \nPlease contact your advisor if you have additional questions about\nthe honors policy, including minimum GPA and institutional credit\nrequirements.\n \nThis table indicates the university requirements for Latin Honors. For\nstudents that meet these requirements, Latin Honors will be printed on the\ncertificate or degree.\n \nRequirements\nRequirements\nAcknowledgment\nAcknowledgment\nMinimum\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.Minimum\nInstitutional\nCredits:\nAssociate’s =\n30 /\nBachelor’s\n=60\nCumulative\nGPA 3.500 -\n3.699\nHonors\nCum Laude\nMinimum\nInstitutional\nCredits:\nAssociate’s =\n30 /\nBachelor’s\n=60\nCumulative\nGPA 3.700 -\n3.849\nHigh Honors\nMagna Cum\nLaude\nMinimum\nInstitutional\nCredits:\nAssociate’s =\n30 /\nBachelor’s\n=60\nCumulative\nGPA 3.850 –\n4.000\nHighest Honors\nSumma Cum\nLaude\nYou have currently earned 54 institutional credits.\nYour current Cumulative GPA is 4.000.\nPlease note:  If you are attending the commencement ceremony and you are\neligible for \nan honors cord, you will not receive it until the day of the\nceremony.\nI understand the institutional policies regarding Latin Honors. \nPlease contact\nyour advisor if you have additional questions about the honors policy,\nincluding minimum GPA and institutional credit requirements.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish yourI understand that at the time of my most recent degree audit on 02/16/23\nthat I was coded as being eligible to participate in in the Spring 2023\nCommencement Ceremony.\n \nCandidates who have an anticipated conferral degree date between January\n1 and May 31 and submitted a petition to graduate by March 1 will be\nscheduled to participate in a Spring Commencement ceremony. Candidates\nwho have an anticipated conferral degree date between June 1 and\nDecember 31 and submitted a petition to graduate by October 1 will be\nscheduled to participate in a Fall Commencement ceremony.  Students who\nsubmit a late petition to graduate will be scheduled to participate in the next\nCommencement ceremony.\n​​​​​​​​​​​​​​\nPlease review the \nCommencement Participation policy\n for more information.\nI understand that the Commencement Office will reach out as the ceremony\ndate approaches to share additional information about dates and times, caps\n& gowns, tickets, and how to register, etc.\nI understand that participation in the commencement ceremony does not\nnecessarily mean that my program is complete.\nThe Commencement ceremony is often referred to as “Graduation,” but is\nactually a separate event altogether! The Commencement ceremony is held\nto celebrate the academic achievements of our students who have\ncompleted, or are close to completing, their program requirements.\nGraduation and conferral, on the other hand, are associated with the term in\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.which you have successfully completed all of your program requirements.\nAt Career Services at Southern New Hampshire University, we care\nabout our students' academic AND professional success. We are here\nto support you from day one to graduation and beyond.\nPlease take a moment to complete this employment data survey.  We\nseek to provide personalized, relevant services for our students\nbased on their educational and professional goals.  The information\nyou share will remain confidential and will be used for data purposes\nonly.\nThis part of the survey will take approximately two to three minutes\nto complete.  Thank you for your time.\nStudent Educational Goal\nAre you Active Duty Military?\n(choose \"No\" if part-time in the Reserves or National Guard)\nYes\nNo, I need more information or clarification. I will submit a request to the Office of\nthe University Registrar in the \nService Portal\n.\n​​​​​​​\nThis link will take you outside the questionnaire to submit your request,\nhowever, please remember to return to the questionnaire to finish your\nresponses.\nNew Career\nCareer Change\nAdvance Current Career\nUnrelated to Career\nYes\nOffice of the University Registrar\nVisit us on the \nSNHU Service Portal\n to submit inquiries and requests relating to your conferral.\nBachelor of Science Computer Science Graduation Questionnaire\nPowered by Qualtrics\nA\nAre you currently employed?\nAre you currently seeking employment?\nDo you need career assistance?\nNo\nYes\nNo\nYes\nNo, I'm focusing exclusively on my education\nNo, I do not want employment at this time due to other reasons\nYes\nNo\nBACK\nNEXT", "uploaded_at": "2025-04-04T21:29:29.605933", "file_size": 241451}